// 12. Мы определили переменную myNestedArray, приравненную к массиву. Измените myNestedArray, используя любую комбинацию строк , чисел и логических значений для элементов данных, чтобы он имел ровно пять уровней глубины (помните, что самый внешний массив имеет уровень 1). Где-то на третьем уровне включите строку deep, на четвертом уровне включите строку deeper и на пятом уровне включите строку deepest.



let myNestedArray = [
    ["unshift", false, 1, 2, 3, "complex", "nested"],
    ["loop", "shift", 6, 7, 1000, "method"],
    ["concat", false, true, "spread", "array", ["deep"]],
    ["mutate", 1327.98, "splice", "slice", "push", [["deeper"]]],
    ["iterate", 1.3849, 7, "8.4876", "arbitrary", "depth", [[["deepest"]]]]
  ];




  